# Laboratorium 2: Łączenie z bazą danych i instrukcja select 

# Filip Domański

## Połączenie się ze zdalną bazą danych przy pomocy sqlAlchemy:

In [1]:
from sqlalchemy import create_engine
import pandas as pd

# Dane do połączenia się z bazą:
# - host: pgsql-196447.vipserv.org
# - port: 5432
# - login: wbauer_adb
# - hasło: adb2020
# - nazwa_bazy: wbauer_adb

db_string = "postgresql://wbauer_adb:adb2020@pgsql-196447.vipserv.org:5432/wbauer_adb"

db = create_engine(db_string)

connection_sqlalchemy = db.connect()

## Wykonane zapytania:

### 1. Ilość kategorii filmów w wypożyczalni.

In [2]:
df = pd.read_sql("SELECT COUNT(category_id) FROM category", con=connection_sqlalchemy)  
display(df)

   count
0     16

### 2. Lista kategorii filmów w kolejności alfabetycznej.

In [3]:
df = pd.read_sql("SELECT name FROM category ORDER BY name ASC", con=connection_sqlalchemy) 
display(df)

           name
0        Action
1     Animation
2      Children
3      Classics
4        Comedy
5   Documentary
6         Drama
7        Family
8       Foreign
9         Games
10       Horror
11        Music
12          New
13       Sci-Fi
14       Sports
15       Travel

### 3. Najstarszy i najmłodszy film w wypożyczalni.

In [4]:
df = pd.read_sql("SELECT title FROM film ORDER BY release_year ASC LIMIT 1", con=connection_sqlalchemy) 
display(df)
    
df = pd.read_sql("SELECT title FROM film ORDER BY release_year DESC LIMIT 1", con=connection_sqlalchemy)  
display(df)
    
df = pd.read_sql("SELECT DISTINCT release_year FROM film", con=connection_sqlalchemy)
display(df)

             title
0  Chamber Italian

             title
0  Chamber Italian

   release_year
0          2006

**Posortowana lista filmów zarówno od najmłodszego jak i najstarszego zaczyna się od tego samego filmu, więc wszystkie filmy zostały wydane w tym samym czasie, co potwierdza lista unikalnych dat wydania - zawiera wyłącznie 2006 rok.**

### 4. Ilość wypożyczeń między 2005-07-01 a 2005-08-01.

In [16]:
df = pd.read_sql("SELECT COUNT(rental_date) FROM rental WHERE rental_date BETWEEN '2005-07-01' AND '2005-08-01'", 
                con=connection_sqlalchemy) 
display(df)

   count
0   6709

### 5. Ilość wypożyczeń między 2010-01-01 a 2011-02-01.

In [17]:
df = pd.read_sql("SELECT COUNT(*) FROM rental WHERE rental_date BETWEEN '2010-01-01' AND '2011-02-01'", 
                con=connection_sqlalchemy)  
display(df)

   count
0      0

### 6. Największa płatność wypożyczenia.

In [7]:
df = pd.read_sql("SELECT * FROM payment WHERE amount=(SELECT MAX(amount) FROM payment)", con=connection_sqlalchemy) 
display(df)

,payment_id,customer_id,staff_id,rental_id,amount,payment_date
0,20403,362,1,14759,11.99,2007-03-21 21:57:24.996577
1,22650,204,2,15415,11.99,2007-03-22 22:17:22.996577
2,23757,116,2,14763,11.99,2007-03-21 22:02:26.996577
3,24553,195,2,16040,11.99,2007-03-23 20:47:59.996577
4,24866,237,2,11479,11.99,2007-03-02 20:46:39.996577
5,28799,591,2,4383,11.99,2007-04-07 19:14:17.996577
6,28814,592,1,3973,11.99,2007-04-06 21:26:57.996577
7,29136,13,2,8831,11.99,2007-04-29 21:06:07.996577

### 7. Wszyscy klienci z Polski, Nigerii oraz Bangladeszu.

In [8]:
df = pd.read_sql("SELECT first_name, last_name, country FROM customer INNER JOIN address USING(address_id) INNER JOIN \
                city USING(city_id) INNER JOIN country USING(country_id) WHERE country IN ('Poland', 'Nigeria', 'Bangladesh')"
                 ,con=connection_sqlalchemy)
display(df)

   first_name  last_name     country
0       Sonia    Gregory     Nigeria
1       Brian      Wyman      Poland
2      Sidney   Burleson      Poland
3      Rodney    Moeller     Nigeria
4     Stephen     Qualls  Bangladesh
5       Velma      Lucas     Nigeria
6     Marilyn       Ross     Nigeria
7       Elsie     Kelley     Nigeria
8      Gladys   Hamilton     Nigeria
9       Frank   Waggoner  Bangladesh
10   Marjorie     Tucker      Poland
11      Carol     Garcia     Nigeria
12       Leah     Curtis      Poland
13      Ruben      Geary      Poland
14       Olga    Jimenez     Nigeria
15     Bertha   Ferguson     Nigeria
16     Tracey    Barrett     Nigeria
17         Jo     Fowler     Nigeria
18    Johnnie   Chisholm      Poland
19    Wallace      Slone     Nigeria
20   Michelle      Clark  Bangladesh
21    Russell    Brinson      Poland
22     Jimmie  Eggleston      Poland
23  Constance       Reid     Nigeria

### 8. Adresy członków personelu.

In [9]:
df = pd.read_sql("SELECT first_name, last_name, address, city, country FROM staff INNER JOIN address USING(address_id) \
                INNER JOIN city USING(city_id) INNER JOIN country USING(country_id)", con=connection_sqlalchemy) 
display(df)

  first_name last_name               address        city    country
0       Mike   Hillyer     23 Workhaven Lane  Lethbridge     Canada
1        Jon  Stephens  1411 Lillydale Drive   Woodridge  Australia

### 9. Ilość pracowników mieszkających w Argentynie lub Hiszpanii.

In [10]:
df = pd.read_sql("SELECT COUNT(staff_id) FROM staff INNER JOIN address USING(address_id) INNER JOIN city USING(city_id) \
                INNER JOIN country USING(country_id) WHERE country='Argentina' OR country='Spain'", con=connection_sqlalchemy) 
display(df)

   count
0      0

### 10. Kategorie filmów wypożyczone przez klientów (+ ilość wypożyczeń dla upewnienia się).

In [34]:
df = pd.read_sql("SELECT DISTINCT name, COUNT(customer_id) FROM category INNER JOIN film_category USING(category_id) INNER \
                JOIN film USING(film_id) INNER JOIN inventory USING(film_id) INNER JOIN rental USING(inventory_id) INNER \
                JOIN customer USING(customer_id) WHERE rental_rate > 0 GROUP BY category_id ORDER BY count DESC", 
                con=connection_sqlalchemy)
display(df)

           name  count
0        Sports   1179
1     Animation   1166
2        Action   1112
3        Sci-Fi   1101
4        Family   1096
5         Drama   1060
6   Documentary   1050
7       Foreign   1033
8         Games    969
9      Children    945
10       Comedy    941
11          New    940
12     Classics    939
13       Horror    846
14       Travel    837
15        Music    830

### 11. Wszystkie kategorie filmów wypożyczonych w Ameryce (+ ilość wypożyczeń dla upewnienia się).

In [35]:
df = pd.read_sql("SELECT DISTINCT name, COUNT(customer_id) FROM category INNER JOIN film_category USING(category_id) INNER \
                JOIN film USING(film_id) INNER JOIN inventory USING(film_id) INNER JOIN rental USING(inventory_id) \
                INNER JOIN customer USING(customer_id) INNER JOIN address USING(address_id) INNER JOIN city \
                USING(city_id) INNER JOIN country USING(country_id) WHERE country='United States' GROUP BY category_id \
                ORDER BY count DESC", con=connection_sqlalchemy)
display(df)

           name  count
0   Documentary     74
1        Sports     73
2         Drama     69
3     Animation     68
4        Family     66
5       Foreign     64
6        Action     62
7        Horror     62
8        Sci-Fi     62
9         Games     60
10       Comedy     59
11     Children     56
12          New     55
13     Classics     54
14        Music     51
15       Travel     33

### 12. Wszystkie tytuły filmów, w których grały: Olympia Pfeiffer, Julia Zellweger lub Ellen Presley.

In [36]:
df = pd.read_sql("SELECT title, first_name, last_name FROM film INNER JOIN film_actor USING(film_id) INNER JOIN \
                actor USING(actor_id) WHERE (first_name='Olympia' AND last_name='Pfeiffer') OR (first_name='Julia' \
                AND last_name='Zellweger') OR (first_name='Ellen' AND last_name='Presley')", con=connection_sqlalchemy)

#wyświetlenie całej tabeli
with pd.option_context('display.max_rows', None, 'display.max_columns', None):
    display(df)

                     title first_name  last_name
0          Bilko Anonymous      Ellen    Presley
1        Caribbean Liberty      Ellen    Presley
2         Casper Dragonfly      Ellen    Presley
3         Empire Malkovich      Ellen    Presley
4            Floats Garden      Ellen    Presley
5         Frogmen Breaking      Ellen    Presley
6           Homeward Cider      Ellen    Presley
7              Hyde Doctor      Ellen    Presley
8           Image Princess      Ellen    Presley
9            Jacket Frisco      Ellen    Presley
10    Microcosmos Paradise      Ellen    Presley
11            Network Peak      Ellen    Presley
12              Oscar Gold      Ellen    Presley
13          Pickup Driving      Ellen    Presley
14         Pinocchio Simon      Ellen    Presley
15            Private Drop      Ellen    Presley
16          Roots Remember      Ellen    Presley
17           Scarface Bang      Ellen    Presley
18         Secretary Rouge      Ellen    Presley
19                Spy Mile      Ellen    Presley
20    Streetcar Intentions      Ellen    Presley
21            Tadpole Park      Ellen    Presley
22        Treasure Command      Ellen    Presley
23               Turn Star      Ellen    Presley
24            Women Dorado      Ellen    Presley
25             Badman Dawn    Olympia   Pfeiffer
26             Chitty Lock    Olympia   Pfeiffer
27      Color Philadelphia    Olympia   Pfeiffer
28       Contact Anonymous    Olympia   Pfeiffer
29            Deep Crusade    Olympia   Pfeiffer
30        Effect Gladiator    Olympia   Pfeiffer
31          Express Lonely    Olympia   Pfeiffer
32       Firehouse Vietnam    Olympia   Pfeiffer
33        Fugitive Maguire    Olympia   Pfeiffer
34           Hanky October    Olympia   Pfeiffer
35            Ice Crossing    Olympia   Pfeiffer
36         Idols Snatchers    Olympia   Pfeiffer
37  Intolerable Intentions    Olympia   Pfeiffer
38      Magnolia Forrester    Olympia   Pfeiffer
39              Mars Roman    Olympia   Pfeiffer
40               Maude Mod    Olympia   Pfeiffer
41        Murder Antitrust    Olympia   Pfeiffer
42            None Spiking    Olympia   Pfeiffer
43             Others Soup    Olympia   Pfeiffer
44           Psycho Shrunk    Olympia   Pfeiffer
45             Santa Paris    Olympia   Pfeiffer
46             Sense Greek    Olympia   Pfeiffer
47         Storm Happiness    Olympia   Pfeiffer
48       Sweet Brotherhood    Olympia   Pfeiffer
49        Titanic Boondock    Olympia   Pfeiffer
50         Tourist Pelican    Olympia   Pfeiffer
51          Traffic Hobbit    Olympia   Pfeiffer
52              Wait Cider    Olympia   Pfeiffer
53    Breakfast Goldfinger      Julia  Zellweger
54        Cranes Reservoir      Julia  Zellweger
55             Dares Pluto      Julia  Zellweger
56        Detective Vision      Julia  Zellweger
57         Divorce Shining      Julia  Zellweger
58         Hollow Jeopardy      Julia  Zellweger
59         Jeopardy Encino      Julia  Zellweger
60        Lambs Cincinatti      Julia  Zellweger
61         Majestic Floats      Julia  Zellweger
62            Minds Truman      Julia  Zellweger
63            Open African      Julia  Zellweger
64            Outlaw Hanky      Julia  Zellweger
65         Panky Submarine      Julia  Zellweger
66        Rider Caddyshack      Julia  Zellweger
67               Won Dares      Julia  Zellweger
68           Wyoming Storm      Julia  Zellweger